[
  {
    "journey": [
      {
        "position": "Software engineer",
        "date": "Jan 2021 - Present"
      }
    ],
    "company": "Sastaticket.pk",
    "points": [
      [
        "Leading flutter mobile (iOS, Android) development project of sastaticket.pk."
      ]
    ]
  },
  {
    "journey": [
      {
        "position": "Full Stack, Flutter and React Native",
        "date": "Sep 2018 - Present"
      }
    ],
    "company": "Fiverr",
    "contract": "Freelance",
    "points": [
      [
        "I mostly took small gigs like build MVP mobile apps using React Native & Flutter for different clients.",
        "I also made small scale custom CMS to manage data with nodeJS & React JS",
        "Also did Fixed bugs, Tunned performance, Updated apps to new flutter version by solving native dependency conflicts & Made very unstable apps to stable stage."
      ]
    ]
  },
  {
    "journey": [
      {
        "position": "Full Stack, Flutter and React Native",
        "date": "May 2018 - Present"
      }
    ],
    "company": "Upwork",
    "contract": "Freelance",
    "points": [
      [
        "During my Upwork journey, I worked two short term jobs where I fixed bugs and improved user experience,",
        "and worked with a long term client where I built small scale MVP apps with React Native and React JS,",
        "Also built `Grow youth app` with React Native and published it on App Store and Play Store"
      ]
    ]
  },
  {
    "company": "Fetch Sky",
    "journey": [
      {
        "position": "Associate Software Engineer",
        "date": "Nov 2017 - Jan 2018"
      },
      {
        "position": "Junior Software Engineer",
        "date": "Dec 2016 - Oct 2017"
      }
    ],
    "points": [
      [
        "Peekaboo Guru is the product of Fetch Sky which is a location-based platform.",
        "that acts as your complete lifestyle guide and shows all the deals and discounts offered in the market.",
        "I contributed technically to the consumer mobile app and website, enterprise mobile SDK, internal admin panel, and backend server.",
        "I had great a experience working with technically advanced seniors which helped me a lot in my career growth."
      ],
      [
        "In consumer web and mobile app development, I got to work on React Native, React JS, styled-components, Redux, Webpack, and Redux-Saga.",
        "I built reusable components while making sure they scale well on multiple screen sizes.",
        "I also learned a great deal about react ecosystem like best practices, proper use of lint, configuring webpack, and firebase."
      ],
      [
        "In the admin panel, I got to work on AngularJS(1.5).",
        "I built complex data tables to show, create, update and delete data.",
        "Also integrated a custom-built lightweight image cropping and resizing module."
      ],
      [
        "In the backend, I got to work on AWS (S3, SES), puppeteer, NodeJS, and MariaDB.",
        "I wrote CRUD API calls for modules and & built a lightweight image cropping module via \"node-canvas\"."
      ]
    ]
  }
]
