[
  {
    "journey": [
      {
        "position": "Software engineer",
        "date": "Jan 2021 - Aug 2021"
      }
    ],
    "company": "Sastaticket.pk",
    "points": [
        "Constructed Pakistan's top-ranked and trending airline traveling app.",
        "Architected the code structure with the Bloc design pattern.",
        "Configured app flavors to maintain QA, Stage, Development, and Production environments.",
        "Integrated Webengage, Mixpanel, AppsFlyer, Facebook, and Firebase analytics according to marketing requirements.",
        "Integrated multiple payment providers also integrated 3D secured credit/debit card payment method.",
        "Integrated push notifications via Webengage and Firebase messaging.",
        "Used flutter's event channel to share data between the dart and native code.",
        "Developed and maintained scripts for automating intl JSON generation, boilerplate code generation, assets generation, and pre-deployment setup.",
        "Developed custom Github Actions & NodeJS script to upload APK on Google Drive directory and share the directory's link via email.",
        "Published Sastaticket.pk's new flutter mobile app with enhanced UI/UX to the app store and the play store.",
        "Interviewed junior and senior candidates and actively contributed to the hiring process and decisions."
    ],
    "tech": [
      "Flutter",
      "Bloc",
      "Provider",
      "Hygen.io",
      "Firebase",
      "Analytics",
      {"label": "Animations", "icon": "mdi-animation-outline"},
      {"label": "Notifications", "icon": "mdi-bell-outline"},
      {"label": "Social Authentication", "icon": "mdi-login-variant"},
      {"label": "Payments", "icon": "mdi-credit-card-outline"},
      {"label": "Google Drive API", "icon": "mdi-google-drive"},
      {"label": "CI/CD", "icon": "mdi-infinity"},
      "Node JS",
      "Github Actions",
      "Javascript",
      {"label": "SMTP", "icon": "mdi-email-send-outline"}
    ]
  },
  {
    "journey": [
      {
        "position": "Full Stack, Flutter and React Native",
        "date": "Since Sep 2018"
      }
    ],
    "company": "Fiverr",
    "contract": "Freelance",
    "points": [
        "Provided gig based service for React JS, React Native, Flutter and Node JS.",
        "Developed ideas and wireframes into prototype apps.",
        "Fixed bugs, optimized implementations and tuned performance.",
        "Constructed a small micro CMS with NodeJS, MYSQL and React Native.",
        "Constructed full stack app with Flutter, MYSQL, Socket.IO, AWS, Firebase ml vision, Speech to text and Adonis 5. Featuring Authentication, Real time chat with voice notes/images, and push notifications.",
        "Constructed full stack app with React Native, with NodeJS, AWS, SendGrid, MYSQL and Firebase ML Vision to extract text from documents."
    ],
    "tech": [
      "React JS",
      "React Native",
      "Flutter",
      "Node JS",
      "Redux",
      "Adonis 5",
      "MYSQL",
      "Firebase",
      {"label": "AWS (S3, SES, RDS, EC2)", "icon": "mdi-aws"},
      {"label": "Notifications", "icon": "mdi-bell-outline"}
    ]
  },
  {
    "journey": [
      {
        "position": "Full Stack, Flutter and React Native",
        "date": "Since May 2018"
      }
    ],
    "company": "Upwork",
    "contract": "Freelance",
    "points": [
        "During my Upwork journey, I worked two short term jobs where I fixed bugs and improved user experience,",
        "and worked with a long term client where I built small scale MVP apps with React Native and React JS,",
        "Also built `Grow youth app` with React Native and published it on App Store and Play Store"
    ]
  },
  {
    "company": "Fetch Sky",
    "journey": [
      {
        "position": "Associate Software Engineer",
        "date": "Nov 2017 - Jan 2018"
      },
      {
        "position": "Junior Software Engineer",
        "date": "Dec 2016 - Oct 2017"
      }
    ],
    "points": [
        "Worked on Peekaboo Guru, Which is a location-based and lifestyle platform.",
        "Worked on NodeJS and MYSQL backend. Wrote CRUD API calls and built a custom lightweight image cropping and sizing module with \"node-canvas\".",
        "Rendered ReactJS based analytics dashboard at server side and took PDF snapshot via puppeteer then sent the PDF to business via email.",
        "Worked on Angular JS internal admin panel. Built CRUD data tables and fixed bugs.",
        "Worked on React Native Redux mobile app. Built reusable UI components, state based HOC and API calls with Redux and Redux-Saga.",
        "Integrated firebase analytics, One signal push notifications, and push notification deep linking.",
        "Worked on React JS Redux web app. Built responsive UI components and Built custom autocomplete component.",
        "Had a chance to work with technically advanced seniors, which helped me in my career growth."
    ],
    "tech": [
      "React JS",
      "React Native",
      "Redux",
      "Redux Saga",
      "Javascript",
      "Firebase",
      "Analytics",
      "Node JS",
      "MYSQL",
      {"label": "Angular JS", "icon": "mdi-angular"},
      {"label": "Notifications", "icon": "mdi-bell-outline"},
      {"label": "Puppeteer", "icon": "mdi-google-chrome"},
      {"label": "AWS (S3, SES)", "icon": "mdi-aws"},
      {"label": "Social Authentication", "icon": "mdi-login-variant"},
      {"label": "Node Canvas", "icon": "mdi-image-size-select-large"},
      {"label": "SMTP", "icon": "mdi-email-send-outline"}
    ]
  }
]
