[
  {
    "journey": [
      {
        "position": "Software engineer",
        "date": "Jan 2021 - Present"
      }
    ],
    "company": "Sastaticket.pk",
    "points": [
      "Leading flutter mobile (iOS, Android) development project of sastaticket.pk."
    ]
  },
  {
    "journey": [
      {
        "position": "Full Stack, Flutter & React Native",
        "date": "Sep 2018 - Present"
      }
    ],
    "company": "Fiverr",
    "contract": "Freelance",
    "points": []
  },
  {
    "journey": [
      {
        "position": "Full Stack, Flutter & React Native",
        "date": "May 2018 - Present"
      }
    ],
    "company": "Upwork",
    "contract": "Freelance",
    "points": []
  },
  {
    "company": "Fetch Sky",
    "journey": [
      {
        "position": "Associate Software Engineer",
        "date": "Nov 2017 - Jan 2018"
      },
      {
        "position": "Junior Software Engineer",
        "date": "Dec 2016 - Oct 2017"
      }
    ],
    "points": [
      "In beginning of my career I worked on product \"Peekaboo Guru\". Peekaboo Guru is a location based platform which acts as your complete lifestyle guide and shows all the deals and discounts offered in the market.",
      "I started working on front-end and back-end of peekaboo's admin panel. Front-end is built with Angular JS (1.5) with ES6 standards and Angular Material as UI framework. Node JS is used as back-end runtime environment and Express JS as Framework with ES6 standards. MYSQL as primary database. I worked on complex dynamic CRUD forms, Data tables with server side filtering and Sorting, REST API end points and Created a light weight module which auto crop, Scale, Resize and Optimize the image.",
      "After promotion I was switched to client web, Moblie App & Mobile SDK development.",
      "Client web is built React JS. Mobile App is built with React Native, while Mobile SDK is extracted version of Mobile App for third parties. In React development HOC pattern is followed, So all business logic can be shared in any React ecosystem."
    ]
  }
]
