[
  {
    "journey": [
      {
        "position": "Software engineer",
        "date": "Jan 2021 - Aug 2021"
      }
    ],
    "company": "Sastaticket.pk",
    "points": [
        "Constructed Pakistan's top-ranked and trending airline traveling app.",
        "Architected the code structure with the Bloc design pattern.",
        "Configured app flavors to maintain QA, Stage, Development, and Production environments.",
        "Integrated Webengage, Mixpanel, AppsFlyer, Facebook, and Firebase analytics according to marketing requirements.",
        "Integrated multiple payment providers also integrated 3D secured credit/debit card payment method.",
        "Used flutter's event channel to share data between the dart and native code.",
        "Integrated push notifications via Webengage and Firebase messaging.",
        "Developed and maintained scripts for automating intl JSON generation, boilerplate code generation, assets generation, and pre-deployment setup.",
        "Developed custom Github Actions & NodeJS script to upload APK on Google Drive directory and share the directory's link via email.",
        "Published Sastaticket.pk's new flutter mobile app with enhanced UI/UX to the app store and the play store."
    ],
    "tech": [
      "Flutter",
      "Bloc",
      "Provider",
      "Hygen.io",
      "Firebase",
      "Analytics",
      {"label": "Animations", "icon": "mdi-animation-outline"},
      {"label": "Notifications", "icon": "mdi-bell-outline"},
      {"label": "Social Authentication", "icon": "mdi-login-variant"},
      {"label": "Payments", "icon": "mdi-credit-card-outline"},
      {"label": "Google Drive API", "icon": "mdi-google-drive"},
      {"label": "CI/CD", "icon": "mdi-infinity"},
      "Node JS",
      "Github Actions",
      "Javascript",
      {"label": "SMTP", "icon": "mdi-email-send-outline"}
    ]
  },
  {
    "journey": [
      {
        "position": "Full Stack, Flutter and React Native",
        "date": "Since Sep 2018"
      }
    ],
    "company": "Fiverr",
    "contract": "Freelance",
    "points": [
        "I mostly took small gigs like build MVP mobile apps using React Native & Flutter for different clients.",
        "I built a small-scale custom CMS for managing data with MYSQL, Node JS, and React JS.",
        "Also did Fixed bugs, tunned performance, Updated apps to new flutter version by solving native dependency conflicts,",
        "Made unstable apps to stable stage."
    ]
  },
  {
    "journey": [
      {
        "position": "Full Stack, Flutter and React Native",
        "date": "Since May 2018"
      }
    ],
    "company": "Upwork",
    "contract": "Freelance",
    "points": [
        "During my Upwork journey, I worked two short term jobs where I fixed bugs and improved user experience,",
        "and worked with a long term client where I built small scale MVP apps with React Native and React JS,",
        "Also built `Grow youth app` with React Native and published it on App Store and Play Store"
    ]
  },
  {
    "company": "Fetch Sky",
    "journey": [
      {
        "position": "Associate Software Engineer",
        "date": "Nov 2017 - Jan 2018"
      },
      {
        "position": "Junior Software Engineer",
        "date": "Dec 2016 - Oct 2017"
      }
    ],
    "points": [
        "At Fetch Sky, I worked on Peekaboo Guru, Which is a location-based platform.",
        "In consumer web and mobile app development, I got to work on React Native, React JS, styled-components, Redux, Webpack, and Redux-Saga.",
        "I built reusable components while making sure they scale well on multiple screen sizes.",
        "I also learned a great deal about react ecosystem like best practices, proper use of lint, configuring webpack, and firebase analytics, monitoring.",
        "In the admin panel, I got to work on AngularJS(1.5).",
        "I built complex data tables for managing data.",
        "Wrote CRUD API calls on NodeJS and MYSQL.",
        "Took PDF snapshot of Analytics dashboard and send via email ",
        "In the backend, I got to work on AWS (S3, SES), puppeteer snapshots, NodeJS, and MYSQL.",
        "I wrote CRUD API calls and built a lightweight image cropping module via \"node-canvas\".",
        "Had a chance to work with technically advanced seniors, which helped me in my career growth."
    ]
  }
]
